program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "1.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.1"}})]
{
    func main<ios15>(tensor<fp32, [1, 80, 3000]> logmel_data) {
            tensor<int32, []> var_20 = const()[name = tensor<string, []>("op_20"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_28 = const()[name = tensor<string, []>("op_28"), val = tensor<int32, [1]>([1])];
            tensor<int32, [1]> var_30 = const()[name = tensor<string, []>("op_30"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_32_pad_type_0 = const()[name = tensor<string, []>("op_32_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_32_pad_0 = const()[name = tensor<string, []>("op_32_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> logmel_data_to_fp16_dtype_0 = const()[name = tensor<string, []>("logmel_data_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [512, 80, 3]> weight_3_to_fp16 = const()[name = tensor<string, []>("weight_3_to_fp16"), val = tensor<fp16, [512, 80, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [512]> bias_3_to_fp16 = const()[name = tensor<string, []>("bias_3_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(245888)))];
            tensor<fp16, [1, 80, 3000]> cast_27 = cast(dtype = logmel_data_to_fp16_dtype_0, x = logmel_data)[name = tensor<string, []>("cast_27")];
            tensor<fp16, [1, 512, 3000]> var_32_cast_fp16 = conv(bias = bias_3_to_fp16, dilations = var_30, groups = var_20, pad = var_32_pad_0, pad_type = var_32_pad_type_0, strides = var_28, weight = weight_3_to_fp16, x = cast_27)[name = tensor<string, []>("op_32_cast_fp16")];
            tensor<string, []> input_1_mode_0 = const()[name = tensor<string, []>("input_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 3000]> input_1_cast_fp16 = gelu(mode = input_1_mode_0, x = var_32_cast_fp16)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<int32, []> var_36 = const()[name = tensor<string, []>("op_36"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> var_45 = const()[name = tensor<string, []>("op_45"), val = tensor<int32, [1]>([2])];
            tensor<int32, [1]> var_47 = const()[name = tensor<string, []>("op_47"), val = tensor<int32, [1]>([1])];
            tensor<string, []> var_49_pad_type_0 = const()[name = tensor<string, []>("op_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [2]> var_49_pad_0 = const()[name = tensor<string, []>("op_49_pad_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [512, 512, 3]> weight_7_to_fp16 = const()[name = tensor<string, []>("weight_7_to_fp16"), val = tensor<fp16, [512, 512, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(246976)))];
            tensor<fp16, [512]> bias_7_to_fp16 = const()[name = tensor<string, []>("bias_7_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1819904)))];
            tensor<fp16, [1, 512, 1500]> var_49_cast_fp16 = conv(bias = bias_7_to_fp16, dilations = var_47, groups = var_36, pad = var_49_pad_0, pad_type = var_49_pad_type_0, strides = var_45, weight = weight_7_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("op_49_cast_fp16")];
            tensor<string, []> x_3_mode_0 = const()[name = tensor<string, []>("x_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 512, 1500]> x_3_cast_fp16 = gelu(mode = x_3_mode_0, x = var_49_cast_fp16)[name = tensor<string, []>("x_3_cast_fp16")];
            tensor<fp16, [512, 1500]> var_53_to_fp16 = const()[name = tensor<string, []>("op_53_to_fp16"), val = tensor<fp16, [512, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1820992)))];
            tensor<fp16, [1, 512, 1500]> var_55_cast_fp16 = add(x = x_3_cast_fp16, y = var_53_to_fp16)[name = tensor<string, []>("op_55_cast_fp16")];
            tensor<int32, [1]> inputs_1_axes_0 = const()[name = tensor<string, []>("inputs_1_axes_0"), val = tensor<int32, [1]>([2])];
            tensor<fp16, [1, 512, 1, 1500]> inputs_1_cast_fp16 = expand_dims(axes = inputs_1_axes_0, x = var_55_cast_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_69 = const()[name = tensor<string, []>("op_69"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_70 = const()[name = tensor<string, []>("op_70"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_79 = const()[name = tensor<string, []>("op_79"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_1_cast_fp16 = reduce_mean(axes = var_79, keep_dims = var_70, x = inputs_1_cast_fp16)[name = tensor<string, []>("channels_mean_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_1_cast_fp16 = sub(x = inputs_1_cast_fp16, y = channels_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_sq_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = zero_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_sq_1_cast_fp16")];
            tensor<int32, [1]> var_83 = const()[name = tensor<string, []>("op_83"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_84_cast_fp16 = reduce_mean(axes = var_83, keep_dims = var_70, x = zero_mean_sq_1_cast_fp16)[name = tensor<string, []>("op_84_cast_fp16")];
            tensor<fp16, []> var_85_to_fp16 = const()[name = tensor<string, []>("op_85_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_86_cast_fp16 = add(x = var_84_cast_fp16, y = var_85_to_fp16)[name = tensor<string, []>("op_86_cast_fp16")];
            tensor<fp16, []> denom_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 1, 1, 1500]> denom_1_cast_fp16 = rsqrt(epsilon = denom_1_epsilon_0_to_fp16, x = var_86_cast_fp16)[name = tensor<string, []>("denom_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> out_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = denom_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_90_to_fp16 = const()[name = tensor<string, []>("op_90_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3357056)))];
            tensor<fp16, [1, 512, 1, 1500]> var_91_cast_fp16 = add(x = out_1_cast_fp16, y = var_90_to_fp16)[name = tensor<string, []>("op_91_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_93_to_fp16 = const()[name = tensor<string, []>("op_93_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3358144)))];
            tensor<fp16, [1, 512, 1, 1500]> input_3_cast_fp16 = mul(x = var_91_cast_fp16, y = var_93_to_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, [2]> var_101 = const()[name = tensor<string, []>("op_101"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_103 = const()[name = tensor<string, []>("op_103"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_1_pad_type_0 = const()[name = tensor<string, []>("q_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_1_pad_0 = const()[name = tensor<string, []>("q_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> var_120_weight_0_to_fp16 = const()[name = tensor<string, []>("op_120_weight_0_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3359232)))];
            tensor<fp16, [512]> var_120_bias_0_to_fp16 = const()[name = tensor<string, []>("op_120_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3883584)))];
            tensor<fp16, [1, 512, 1, 1500]> var_120_cast_fp16 = conv(bias = var_120_bias_0_to_fp16, dilations = var_103, groups = var_69, pad = q_1_pad_0, pad_type = q_1_pad_type_0, strides = var_101, weight = var_120_weight_0_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_120_cast_fp16")];
            tensor<int32, [2]> var_107 = const()[name = tensor<string, []>("op_107"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_109 = const()[name = tensor<string, []>("op_109"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_1_pad_type_0 = const()[name = tensor<string, []>("k_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_1_pad_0 = const()[name = tensor<string, []>("k_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> blocks_0_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_key_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3884672)))];
            tensor<fp16, [1, 512, 1, 1500]> k_1_cast_fp16 = conv(dilations = var_109, groups = var_69, pad = k_1_pad_0, pad_type = k_1_pad_type_0, strides = var_107, weight = blocks_0_attn_key_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("k_1_cast_fp16")];
            tensor<int32, [2]> var_114 = const()[name = tensor<string, []>("op_114"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_116 = const()[name = tensor<string, []>("op_116"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_118_pad_type_0 = const()[name = tensor<string, []>("op_118_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_118_pad_0 = const()[name = tensor<string, []>("op_118_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> blocks_0_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4409024)))];
            tensor<fp16, [512]> blocks_0_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4933376)))];
            tensor<fp16, [1, 512, 1, 1500]> var_118_cast_fp16 = conv(bias = blocks_0_attn_value_bias_to_fp16, dilations = var_116, groups = var_69, pad = var_118_pad_0, pad_type = var_118_pad_type_0, strides = var_114, weight = blocks_0_attn_value_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("op_118_cast_fp16")];
            tensor<int32, [8]> tile_0 = const()[name = tensor<string, []>("tile_0"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_121_axis_0 = const()[name = tensor<string, []>("op_121_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_121_cast_fp16_7 = split(axis = var_121_axis_0, split_sizes = tile_0, x = var_120_cast_fp16)[name = tensor<string, []>("op_121_cast_fp16")];
            tensor<int32, [4]> var_130_perm_0 = const()[name = tensor<string, []>("op_130_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [8]> tile_1 = const()[name = tensor<string, []>("tile_1"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_131_axis_0 = const()[name = tensor<string, []>("op_131_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 512]> transpose_6 = transpose(perm = var_130_perm_0, x = k_1_cast_fp16)[name = tensor<string, []>("transpose_6")];
            tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_131_cast_fp16_7 = split(axis = var_131_axis_0, split_sizes = tile_1, x = transpose_6)[name = tensor<string, []>("op_131_cast_fp16")];
            tensor<int32, [8]> tile_2 = const()[name = tensor<string, []>("tile_2"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_140_axis_0 = const()[name = tensor<string, []>("op_140_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_140_cast_fp16_7 = split(axis = var_140_axis_0, split_sizes = tile_2, x = var_118_cast_fp16)[name = tensor<string, []>("op_140_cast_fp16")];
            tensor<string, []> aw_1_equation_0 = const()[name = tensor<string, []>("aw_1_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_1_cast_fp16 = einsum(equation = aw_1_equation_0, values = (var_131_cast_fp16_0, var_121_cast_fp16_0))[name = tensor<string, []>("aw_1_cast_fp16")];
            tensor<string, []> aw_3_equation_0 = const()[name = tensor<string, []>("aw_3_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_3_cast_fp16 = einsum(equation = aw_3_equation_0, values = (var_131_cast_fp16_1, var_121_cast_fp16_1))[name = tensor<string, []>("aw_3_cast_fp16")];
            tensor<string, []> aw_5_equation_0 = const()[name = tensor<string, []>("aw_5_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_5_cast_fp16 = einsum(equation = aw_5_equation_0, values = (var_131_cast_fp16_2, var_121_cast_fp16_2))[name = tensor<string, []>("aw_5_cast_fp16")];
            tensor<string, []> aw_7_equation_0 = const()[name = tensor<string, []>("aw_7_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_7_cast_fp16 = einsum(equation = aw_7_equation_0, values = (var_131_cast_fp16_3, var_121_cast_fp16_3))[name = tensor<string, []>("aw_7_cast_fp16")];
            tensor<string, []> aw_9_equation_0 = const()[name = tensor<string, []>("aw_9_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_9_cast_fp16 = einsum(equation = aw_9_equation_0, values = (var_131_cast_fp16_4, var_121_cast_fp16_4))[name = tensor<string, []>("aw_9_cast_fp16")];
            tensor<string, []> aw_11_equation_0 = const()[name = tensor<string, []>("aw_11_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_11_cast_fp16 = einsum(equation = aw_11_equation_0, values = (var_131_cast_fp16_5, var_121_cast_fp16_5))[name = tensor<string, []>("aw_11_cast_fp16")];
            tensor<string, []> aw_13_equation_0 = const()[name = tensor<string, []>("aw_13_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_13_cast_fp16 = einsum(equation = aw_13_equation_0, values = (var_131_cast_fp16_6, var_121_cast_fp16_6))[name = tensor<string, []>("aw_13_cast_fp16")];
            tensor<string, []> aw_15_equation_0 = const()[name = tensor<string, []>("aw_15_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_15_cast_fp16 = einsum(equation = aw_15_equation_0, values = (var_131_cast_fp16_7, var_121_cast_fp16_7))[name = tensor<string, []>("aw_15_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_165_cast_fp16 = softmax(axis = var_69, x = aw_1_cast_fp16)[name = tensor<string, []>("op_165_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_166_cast_fp16 = softmax(axis = var_69, x = aw_3_cast_fp16)[name = tensor<string, []>("op_166_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_167_cast_fp16 = softmax(axis = var_69, x = aw_5_cast_fp16)[name = tensor<string, []>("op_167_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_168_cast_fp16 = softmax(axis = var_69, x = aw_7_cast_fp16)[name = tensor<string, []>("op_168_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_169_cast_fp16 = softmax(axis = var_69, x = aw_9_cast_fp16)[name = tensor<string, []>("op_169_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_170_cast_fp16 = softmax(axis = var_69, x = aw_11_cast_fp16)[name = tensor<string, []>("op_170_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_171_cast_fp16 = softmax(axis = var_69, x = aw_13_cast_fp16)[name = tensor<string, []>("op_171_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_172_cast_fp16 = softmax(axis = var_69, x = aw_15_cast_fp16)[name = tensor<string, []>("op_172_cast_fp16")];
            tensor<string, []> var_174_equation_0 = const()[name = tensor<string, []>("op_174_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_174_cast_fp16 = einsum(equation = var_174_equation_0, values = (var_140_cast_fp16_0, var_165_cast_fp16))[name = tensor<string, []>("op_174_cast_fp16")];
            tensor<string, []> var_176_equation_0 = const()[name = tensor<string, []>("op_176_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_176_cast_fp16 = einsum(equation = var_176_equation_0, values = (var_140_cast_fp16_1, var_166_cast_fp16))[name = tensor<string, []>("op_176_cast_fp16")];
            tensor<string, []> var_178_equation_0 = const()[name = tensor<string, []>("op_178_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_178_cast_fp16 = einsum(equation = var_178_equation_0, values = (var_140_cast_fp16_2, var_167_cast_fp16))[name = tensor<string, []>("op_178_cast_fp16")];
            tensor<string, []> var_180_equation_0 = const()[name = tensor<string, []>("op_180_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_180_cast_fp16 = einsum(equation = var_180_equation_0, values = (var_140_cast_fp16_3, var_168_cast_fp16))[name = tensor<string, []>("op_180_cast_fp16")];
            tensor<string, []> var_182_equation_0 = const()[name = tensor<string, []>("op_182_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_182_cast_fp16 = einsum(equation = var_182_equation_0, values = (var_140_cast_fp16_4, var_169_cast_fp16))[name = tensor<string, []>("op_182_cast_fp16")];
            tensor<string, []> var_184_equation_0 = const()[name = tensor<string, []>("op_184_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_184_cast_fp16 = einsum(equation = var_184_equation_0, values = (var_140_cast_fp16_5, var_170_cast_fp16))[name = tensor<string, []>("op_184_cast_fp16")];
            tensor<string, []> var_186_equation_0 = const()[name = tensor<string, []>("op_186_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_186_cast_fp16 = einsum(equation = var_186_equation_0, values = (var_140_cast_fp16_6, var_171_cast_fp16))[name = tensor<string, []>("op_186_cast_fp16")];
            tensor<string, []> var_188_equation_0 = const()[name = tensor<string, []>("op_188_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_188_cast_fp16 = einsum(equation = var_188_equation_0, values = (var_140_cast_fp16_7, var_172_cast_fp16))[name = tensor<string, []>("op_188_cast_fp16")];
            tensor<bool, []> input_5_interleave_0 = const()[name = tensor<string, []>("input_5_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 1, 1500]> input_5_cast_fp16 = concat(axis = var_69, interleave = input_5_interleave_0, values = (var_174_cast_fp16, var_176_cast_fp16, var_178_cast_fp16, var_180_cast_fp16, var_182_cast_fp16, var_184_cast_fp16, var_186_cast_fp16, var_188_cast_fp16))[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [2]> var_193 = const()[name = tensor<string, []>("op_193"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_195 = const()[name = tensor<string, []>("op_195"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_197_pad_type_0 = const()[name = tensor<string, []>("op_197_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_197_pad_0 = const()[name = tensor<string, []>("op_197_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> blocks_0_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4934464)))];
            tensor<fp16, [512]> blocks_0_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_attn_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5458816)))];
            tensor<fp16, [1, 512, 1, 1500]> var_197_cast_fp16 = conv(bias = blocks_0_attn_out_bias_to_fp16, dilations = var_195, groups = var_69, pad = var_197_pad_0, pad_type = var_197_pad_type_0, strides = var_193, weight = blocks_0_attn_out_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("op_197_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> inputs_3_cast_fp16 = add(x = inputs_1_cast_fp16, y = var_197_cast_fp16)[name = tensor<string, []>("inputs_3_cast_fp16")];
            tensor<int32, [1]> var_201 = const()[name = tensor<string, []>("op_201"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_3_cast_fp16 = reduce_mean(axes = var_201, keep_dims = var_70, x = inputs_3_cast_fp16)[name = tensor<string, []>("channels_mean_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_3_cast_fp16 = sub(x = inputs_3_cast_fp16, y = channels_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_sq_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = zero_mean_3_cast_fp16)[name = tensor<string, []>("zero_mean_sq_3_cast_fp16")];
            tensor<int32, [1]> var_205 = const()[name = tensor<string, []>("op_205"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_206_cast_fp16 = reduce_mean(axes = var_205, keep_dims = var_70, x = zero_mean_sq_3_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<fp16, []> var_207_to_fp16 = const()[name = tensor<string, []>("op_207_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_208_cast_fp16 = add(x = var_206_cast_fp16, y = var_207_to_fp16)[name = tensor<string, []>("op_208_cast_fp16")];
            tensor<fp16, []> denom_3_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_3_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 1, 1, 1500]> denom_3_cast_fp16 = rsqrt(epsilon = denom_3_epsilon_0_to_fp16, x = var_208_cast_fp16)[name = tensor<string, []>("denom_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> out_3_cast_fp16 = mul(x = zero_mean_3_cast_fp16, y = denom_3_cast_fp16)[name = tensor<string, []>("out_3_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_212_to_fp16 = const()[name = tensor<string, []>("op_212_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5459904)))];
            tensor<fp16, [1, 512, 1, 1500]> var_213_cast_fp16 = add(x = out_3_cast_fp16, y = var_212_to_fp16)[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_215_to_fp16 = const()[name = tensor<string, []>("op_215_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5460992)))];
            tensor<fp16, [1, 512, 1, 1500]> input_7_cast_fp16 = mul(x = var_213_cast_fp16, y = var_215_to_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [2]> var_221 = const()[name = tensor<string, []>("op_221"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_223 = const()[name = tensor<string, []>("op_223"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [2048, 512, 1, 1]> blocks_0_mlp_0_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_weight_to_fp16"), val = tensor<fp16, [2048, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5462080)))];
            tensor<fp16, [2048]> blocks_0_mlp_0_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_0_bias_to_fp16"), val = tensor<fp16, [2048]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7559296)))];
            tensor<fp16, [1, 2048, 1, 1500]> input_9_cast_fp16 = conv(bias = blocks_0_mlp_0_bias_to_fp16, dilations = var_223, groups = var_69, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_221, weight = blocks_0_mlp_0_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<string, []> input_11_mode_0 = const()[name = tensor<string, []>("input_11_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 2048, 1, 1500]> input_11_cast_fp16 = gelu(mode = input_11_mode_0, x = input_9_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [2]> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_233_pad_type_0 = const()[name = tensor<string, []>("op_233_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_233_pad_0 = const()[name = tensor<string, []>("op_233_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 2048, 1, 1]> blocks_0_mlp_2_weight_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_weight_to_fp16"), val = tensor<fp16, [512, 2048, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7563456)))];
            tensor<fp16, [512]> blocks_0_mlp_2_bias_to_fp16 = const()[name = tensor<string, []>("blocks_0_mlp_2_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9660672)))];
            tensor<fp16, [1, 512, 1, 1500]> var_233_cast_fp16 = conv(bias = blocks_0_mlp_2_bias_to_fp16, dilations = var_231, groups = var_69, pad = var_233_pad_0, pad_type = var_233_pad_type_0, strides = var_229, weight = blocks_0_mlp_2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> inputs_5_cast_fp16 = add(x = inputs_3_cast_fp16, y = var_233_cast_fp16)[name = tensor<string, []>("inputs_5_cast_fp16")];
            tensor<int32, []> var_241 = const()[name = tensor<string, []>("op_241"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_242 = const()[name = tensor<string, []>("op_242"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_5_cast_fp16 = reduce_mean(axes = var_251, keep_dims = var_242, x = inputs_5_cast_fp16)[name = tensor<string, []>("channels_mean_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_5_cast_fp16 = sub(x = inputs_5_cast_fp16, y = channels_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_sq_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = zero_mean_5_cast_fp16)[name = tensor<string, []>("zero_mean_sq_5_cast_fp16")];
            tensor<int32, [1]> var_255 = const()[name = tensor<string, []>("op_255"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_256_cast_fp16 = reduce_mean(axes = var_255, keep_dims = var_242, x = zero_mean_sq_5_cast_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<fp16, []> var_257_to_fp16 = const()[name = tensor<string, []>("op_257_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_258_cast_fp16 = add(x = var_256_cast_fp16, y = var_257_to_fp16)[name = tensor<string, []>("op_258_cast_fp16")];
            tensor<fp16, []> denom_5_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_5_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 1, 1, 1500]> denom_5_cast_fp16 = rsqrt(epsilon = denom_5_epsilon_0_to_fp16, x = var_258_cast_fp16)[name = tensor<string, []>("denom_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> out_5_cast_fp16 = mul(x = zero_mean_5_cast_fp16, y = denom_5_cast_fp16)[name = tensor<string, []>("out_5_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_262_to_fp16 = const()[name = tensor<string, []>("op_262_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9661760)))];
            tensor<fp16, [1, 512, 1, 1500]> var_263_cast_fp16 = add(x = out_5_cast_fp16, y = var_262_to_fp16)[name = tensor<string, []>("op_263_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_265_to_fp16 = const()[name = tensor<string, []>("op_265_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9662848)))];
            tensor<fp16, [1, 512, 1, 1500]> input_13_cast_fp16 = mul(x = var_263_cast_fp16, y = var_265_to_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<int32, [2]> var_273 = const()[name = tensor<string, []>("op_273"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_275 = const()[name = tensor<string, []>("op_275"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> q_3_pad_type_0 = const()[name = tensor<string, []>("q_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> q_3_pad_0 = const()[name = tensor<string, []>("q_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> var_292_weight_0_to_fp16 = const()[name = tensor<string, []>("op_292_weight_0_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9663936)))];
            tensor<fp16, [512]> var_292_bias_0_to_fp16 = const()[name = tensor<string, []>("op_292_bias_0_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10188288)))];
            tensor<fp16, [1, 512, 1, 1500]> var_292_cast_fp16 = conv(bias = var_292_bias_0_to_fp16, dilations = var_275, groups = var_241, pad = q_3_pad_0, pad_type = q_3_pad_type_0, strides = var_273, weight = var_292_weight_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_292_cast_fp16")];
            tensor<int32, [2]> var_279 = const()[name = tensor<string, []>("op_279"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_281 = const()[name = tensor<string, []>("op_281"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> k_3_pad_type_0 = const()[name = tensor<string, []>("k_3_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> k_3_pad_0 = const()[name = tensor<string, []>("k_3_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> blocks_1_attn_key_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_key_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10189376)))];
            tensor<fp16, [1, 512, 1, 1500]> k_3_cast_fp16 = conv(dilations = var_281, groups = var_241, pad = k_3_pad_0, pad_type = k_3_pad_type_0, strides = var_279, weight = blocks_1_attn_key_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("k_3_cast_fp16")];
            tensor<int32, [2]> var_286 = const()[name = tensor<string, []>("op_286"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_288 = const()[name = tensor<string, []>("op_288"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_290_pad_type_0 = const()[name = tensor<string, []>("op_290_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_290_pad_0 = const()[name = tensor<string, []>("op_290_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> blocks_1_attn_value_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10713728)))];
            tensor<fp16, [512]> blocks_1_attn_value_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_value_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11238080)))];
            tensor<fp16, [1, 512, 1, 1500]> var_290_cast_fp16 = conv(bias = blocks_1_attn_value_bias_to_fp16, dilations = var_288, groups = var_241, pad = var_290_pad_0, pad_type = var_290_pad_type_0, strides = var_286, weight = blocks_1_attn_value_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("op_290_cast_fp16")];
            tensor<int32, [8]> tile_3 = const()[name = tensor<string, []>("tile_3"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_293_axis_0 = const()[name = tensor<string, []>("op_293_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_293_cast_fp16_7 = split(axis = var_293_axis_0, split_sizes = tile_3, x = var_292_cast_fp16)[name = tensor<string, []>("op_293_cast_fp16")];
            tensor<int32, [4]> var_302_perm_0 = const()[name = tensor<string, []>("op_302_perm_0"), val = tensor<int32, [4]>([0, 3, 2, 1])];
            tensor<int32, [8]> tile_4 = const()[name = tensor<string, []>("tile_4"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_303_axis_0 = const()[name = tensor<string, []>("op_303_axis_0"), val = tensor<int32, []>(3)];
            tensor<fp16, [1, 1500, 1, 512]> transpose_5 = transpose(perm = var_302_perm_0, x = k_3_cast_fp16)[name = tensor<string, []>("transpose_5")];
            tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_0, tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_1, tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_2, tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_3, tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_4, tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_5, tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_6, tensor<fp16, [1, 1500, 1, 64]> var_303_cast_fp16_7 = split(axis = var_303_axis_0, split_sizes = tile_4, x = transpose_5)[name = tensor<string, []>("op_303_cast_fp16")];
            tensor<int32, [8]> tile_5 = const()[name = tensor<string, []>("tile_5"), val = tensor<int32, [8]>([64, 64, 64, 64, 64, 64, 64, 64])];
            tensor<int32, []> var_312_axis_0 = const()[name = tensor<string, []>("op_312_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_0, tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_1, tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_2, tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_3, tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_4, tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_5, tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_6, tensor<fp16, [1, 64, 1, 1500]> var_312_cast_fp16_7 = split(axis = var_312_axis_0, split_sizes = tile_5, x = var_290_cast_fp16)[name = tensor<string, []>("op_312_cast_fp16")];
            tensor<string, []> aw_17_equation_0 = const()[name = tensor<string, []>("aw_17_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_17_cast_fp16 = einsum(equation = aw_17_equation_0, values = (var_303_cast_fp16_0, var_293_cast_fp16_0))[name = tensor<string, []>("aw_17_cast_fp16")];
            tensor<string, []> aw_19_equation_0 = const()[name = tensor<string, []>("aw_19_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_19_cast_fp16 = einsum(equation = aw_19_equation_0, values = (var_303_cast_fp16_1, var_293_cast_fp16_1))[name = tensor<string, []>("aw_19_cast_fp16")];
            tensor<string, []> aw_21_equation_0 = const()[name = tensor<string, []>("aw_21_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_21_cast_fp16 = einsum(equation = aw_21_equation_0, values = (var_303_cast_fp16_2, var_293_cast_fp16_2))[name = tensor<string, []>("aw_21_cast_fp16")];
            tensor<string, []> aw_23_equation_0 = const()[name = tensor<string, []>("aw_23_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_23_cast_fp16 = einsum(equation = aw_23_equation_0, values = (var_303_cast_fp16_3, var_293_cast_fp16_3))[name = tensor<string, []>("aw_23_cast_fp16")];
            tensor<string, []> aw_25_equation_0 = const()[name = tensor<string, []>("aw_25_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_25_cast_fp16 = einsum(equation = aw_25_equation_0, values = (var_303_cast_fp16_4, var_293_cast_fp16_4))[name = tensor<string, []>("aw_25_cast_fp16")];
            tensor<string, []> aw_27_equation_0 = const()[name = tensor<string, []>("aw_27_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_27_cast_fp16 = einsum(equation = aw_27_equation_0, values = (var_303_cast_fp16_5, var_293_cast_fp16_5))[name = tensor<string, []>("aw_27_cast_fp16")];
            tensor<string, []> aw_29_equation_0 = const()[name = tensor<string, []>("aw_29_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_29_cast_fp16 = einsum(equation = aw_29_equation_0, values = (var_303_cast_fp16_6, var_293_cast_fp16_6))[name = tensor<string, []>("aw_29_cast_fp16")];
            tensor<string, []> aw_31_equation_0 = const()[name = tensor<string, []>("aw_31_equation_0"), val = tensor<string, []>("bkhc,bchq->bkhq")];
            tensor<fp16, [1, 1500, 1, 1500]> aw_31_cast_fp16 = einsum(equation = aw_31_equation_0, values = (var_303_cast_fp16_7, var_293_cast_fp16_7))[name = tensor<string, []>("aw_31_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_337_cast_fp16 = softmax(axis = var_241, x = aw_17_cast_fp16)[name = tensor<string, []>("op_337_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_338_cast_fp16 = softmax(axis = var_241, x = aw_19_cast_fp16)[name = tensor<string, []>("op_338_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_339_cast_fp16 = softmax(axis = var_241, x = aw_21_cast_fp16)[name = tensor<string, []>("op_339_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_340_cast_fp16 = softmax(axis = var_241, x = aw_23_cast_fp16)[name = tensor<string, []>("op_340_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_341_cast_fp16 = softmax(axis = var_241, x = aw_25_cast_fp16)[name = tensor<string, []>("op_341_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_342_cast_fp16 = softmax(axis = var_241, x = aw_27_cast_fp16)[name = tensor<string, []>("op_342_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_343_cast_fp16 = softmax(axis = var_241, x = aw_29_cast_fp16)[name = tensor<string, []>("op_343_cast_fp16")];
            tensor<fp16, [1, 1500, 1, 1500]> var_344_cast_fp16 = softmax(axis = var_241, x = aw_31_cast_fp16)[name = tensor<string, []>("op_344_cast_fp16")];
            tensor<string, []> var_346_equation_0 = const()[name = tensor<string, []>("op_346_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_346_cast_fp16 = einsum(equation = var_346_equation_0, values = (var_312_cast_fp16_0, var_337_cast_fp16))[name = tensor<string, []>("op_346_cast_fp16")];
            tensor<string, []> var_348_equation_0 = const()[name = tensor<string, []>("op_348_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_348_cast_fp16 = einsum(equation = var_348_equation_0, values = (var_312_cast_fp16_1, var_338_cast_fp16))[name = tensor<string, []>("op_348_cast_fp16")];
            tensor<string, []> var_350_equation_0 = const()[name = tensor<string, []>("op_350_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_350_cast_fp16 = einsum(equation = var_350_equation_0, values = (var_312_cast_fp16_2, var_339_cast_fp16))[name = tensor<string, []>("op_350_cast_fp16")];
            tensor<string, []> var_352_equation_0 = const()[name = tensor<string, []>("op_352_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_352_cast_fp16 = einsum(equation = var_352_equation_0, values = (var_312_cast_fp16_3, var_340_cast_fp16))[name = tensor<string, []>("op_352_cast_fp16")];
            tensor<string, []> var_354_equation_0 = const()[name = tensor<string, []>("op_354_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_354_cast_fp16 = einsum(equation = var_354_equation_0, values = (var_312_cast_fp16_4, var_341_cast_fp16))[name = tensor<string, []>("op_354_cast_fp16")];
            tensor<string, []> var_356_equation_0 = const()[name = tensor<string, []>("op_356_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_356_cast_fp16 = einsum(equation = var_356_equation_0, values = (var_312_cast_fp16_5, var_342_cast_fp16))[name = tensor<string, []>("op_356_cast_fp16")];
            tensor<string, []> var_358_equation_0 = const()[name = tensor<string, []>("op_358_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_358_cast_fp16 = einsum(equation = var_358_equation_0, values = (var_312_cast_fp16_6, var_343_cast_fp16))[name = tensor<string, []>("op_358_cast_fp16")];
            tensor<string, []> var_360_equation_0 = const()[name = tensor<string, []>("op_360_equation_0"), val = tensor<string, []>("bchk,bkhq->bchq")];
            tensor<fp16, [1, 64, 1, 1500]> var_360_cast_fp16 = einsum(equation = var_360_equation_0, values = (var_312_cast_fp16_7, var_344_cast_fp16))[name = tensor<string, []>("op_360_cast_fp16")];
            tensor<bool, []> input_15_interleave_0 = const()[name = tensor<string, []>("input_15_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 512, 1, 1500]> input_15_cast_fp16 = concat(axis = var_241, interleave = input_15_interleave_0, values = (var_346_cast_fp16, var_348_cast_fp16, var_350_cast_fp16, var_352_cast_fp16, var_354_cast_fp16, var_356_cast_fp16, var_358_cast_fp16, var_360_cast_fp16))[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_365 = const()[name = tensor<string, []>("op_365"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_367 = const()[name = tensor<string, []>("op_367"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> var_369_pad_type_0 = const()[name = tensor<string, []>("op_369_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_369_pad_0 = const()[name = tensor<string, []>("op_369_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> blocks_1_attn_out_weight_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_out_weight_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11239168)))];
            tensor<fp16, [512]> blocks_1_attn_out_bias_to_fp16 = const()[name = tensor<string, []>("blocks_1_attn_out_bias_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11763520)))];
            tensor<fp16, [1, 512, 1, 1500]> var_369_cast_fp16 = conv(bias = blocks_1_attn_out_bias_to_fp16, dilations = var_367, groups = var_241, pad = var_369_pad_0, pad_type = var_369_pad_type_0, strides = var_365, weight = blocks_1_attn_out_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("op_369_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> inputs_7_cast_fp16 = add(x = inputs_5_cast_fp16, y = var_369_cast_fp16)[name = tensor<string, []>("inputs_7_cast_fp16")];
            tensor<int32, [1]> var_373 = const()[name = tensor<string, []>("op_373"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_7_cast_fp16 = reduce_mean(axes = var_373, keep_dims = var_242, x = inputs_7_cast_fp16)[name = tensor<string, []>("channels_mean_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_7_cast_fp16 = sub(x = inputs_7_cast_fp16, y = channels_mean_7_cast_fp16)[name = tensor<string, []>("zero_mean_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> zero_mean_sq_7_cast_fp16 = mul(x = zero_mean_7_cast_fp16, y = zero_mean_7_cast_fp16)[name = tensor<string, []>("zero_mean_sq_7_cast_fp16")];
            tensor<int32, [1]> var_377 = const()[name = tensor<string, []>("op_377"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_378_cast_fp16 = reduce_mean(axes = var_377, keep_dims = var_242, x = zero_mean_sq_7_cast_fp16)[name = tensor<string, []>("op_378_cast_fp16")];
            tensor<fp16, []> var_379_to_fp16 = const()[name = tensor<string, []>("op_379_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_380_cast_fp16 = add(x = var_378_cast_fp16, y = var_379_to_fp16)[name = tensor<string, []>("op_380_cast_fp16")];
            tensor<fp16, []> denom_7_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_7_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 1, 1, 1500]> denom_7_cast_fp16 = rsqrt(epsilon = denom_7_epsilon_0_to_fp16, x = var_380_cast_fp16)[name = tensor<string, []>("denom_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1500]> out_7_cast_fp16 = mul(x = zero_mean_7_cast_fp16, y = denom_7_cast_fp16)[name = tensor<string, []>("out_7_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_384_to_fp16 = const()[name = tensor<string, []>("op_384_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11764608)))];
            tensor<fp16, [1, 512, 1, 1500]> var_385_cast_fp16 = add(x = out_7_cast_fp16, y = var_384_to_fp16)[name = tensor<string, []>("op_385_cast_fp16")];
            tensor<fp16, [1, 512, 1, 1]> var_387_to_fp16 = const()[name = tensor<string, []>("op_387_to_fp16"), val = tensor<fp16, [1, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11765696)))];
